In [1]:
import pandas as pd
import numpy as np

## Series

Una serie es un arreglo unidimensional indexado que puede soportar diferentes tipos de datos (`int`,`float`,`string`,`objects`, etc.). 

Para crear una serie

```s = pd.Series(data, index=index)```

En este caso, data puede ser:
- un diccionario
- un ndarray
- un escalar

In [2]:
s = pd.Series(np.random.randn(5), index= ['a','b','c','d','e'])

In [3]:
s

a    0.675521
b    0.588226
c   -0.609911
d   -1.539766
e    0.380584
dtype: float64

In [4]:
type(s)

pandas.core.series.Series

In [7]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [8]:
pd.Series(np.random.randn(5))

0    0.519943
1    2.480828
2   -0.604857
3    1.036046
4    1.137022
dtype: float64

In [9]:
d = {'b':1, 'a':0, 'c':2}

In [10]:
pd.Series(d)

b    1
a    0
c    2
dtype: int64

In [11]:
pd.Series(d, index=['a','b','c'])

a    0
b    1
c    2
dtype: int64

In [12]:
pd.Series(d, index=['a','b','c','d'])

a    0.0
b    1.0
c    2.0
d    NaN
dtype: float64

Aquí aparece por primera vez `NaN` que significa not a number.

In [13]:
pd.Series(5, index=range(5))

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [16]:
pd.Series(5)

0    5
dtype: int64

Si queremos acceder a los elementos de la serie, se pueden utilizar los mismos métodos de los `ndarray`.

In [17]:
s

a    0.675521
b    0.588226
c   -0.609911
d   -1.539766
e    0.380584
dtype: float64

In [18]:
s[0]

0.6755213469290614

In [19]:
s[:3]

a    0.675521
b    0.588226
c   -0.609911
dtype: float64

In [20]:
s['a']

0.6755213469290614

In [21]:
s['b']

0.5882263671867354

In [ ]:
s['f']

La serie soporta operaciones como los `ndarray`.

In [23]:
s + s

a    1.351043
b    1.176453
c   -1.219822
d   -3.079532
e    0.761168
dtype: float64

In [24]:
s * 2

a    1.351043
b    1.176453
c   -1.219822
d   -3.079532
e    0.761168
dtype: float64

In [25]:
np.exp(s)

a    1.965057
b    1.800792
c    0.543399
d    0.214431
e    1.463139
dtype: float64

Algunos atributos de las series

In [26]:
s.array

<PandasArray>
[ 0.6755213469290614,  0.5882263671867354, -0.6099109574907965,
 -1.5397657573636154,  0.3805839451901605]
Length: 5, dtype: float64

In [27]:
s.dtypes

dtype('float64')

In [28]:
s.mean()

-0.10106901110969095

In [29]:
s.median()

0.3805839451901605

In [30]:
s.max()

0.6755213469290614

In [31]:
s.min()

-1.5397657573636154

## DataFrames

Un DataFrame es una estructura de datos bidimensional etiquetada con columnas de diferentes tipos. Se puede pensar como una spreadsheet o una tabla de SQL.

- Diccionarios con arreglos de una dimensión `ndarray`, listas, diccionarios o series.

- `numpy.ndarray` de dos dimensiones

- Series

- Otro DataFrame

Junto con los datos se pueden incluir los argumentos **index** (etiquetas de las filas) y **columns** (etiquetas de las columnas).

In [32]:
d = {'foo': pd.Series([1,2,3], index=['a','b','c']),
     'bar': pd.Series([1,2,3,4], index=['a','b','c','d'])}

In [33]:
df = pd.DataFrame(d)

In [34]:
df

   foo  bar
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [35]:
pd.DataFrame(d, index=['d','b','a'])

   foo  bar
d  NaN    4
b  2.0    2
a  1.0    1

In [36]:
pd.DataFrame(d, index=['d','b','a','m'])

   foo  bar
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0
m  NaN  NaN

In [37]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [38]:
df.columns

Index(['foo', 'bar'], dtype='object')

In [43]:
d = {'foo':[1,2,3,4],
     'bar':[4,3,2,1]}

In [44]:
pd.DataFrame(d)

   foo  bar
0    1    4
1    2    3
2    3    2
3    4    1

In [45]:
pd.DataFrame(d, index=['a','b','c','d'])

   foo  bar
a    1    4
b    2    3
c    3    2
d    4    1

### Seleccionar, agregar, eliminar

In [46]:
df = pd.DataFrame(np.random.randint(0,100,10000).reshape(2000,5),
                  columns=['A','B','C','D','E'])

In [50]:
df.head()

    A   B   C   D   E
0  13  85  41  32  63
1  91  59  94  44  46
2  55   6  63  25  36
3  43  62  79  95  14
4  66  47  34  48  82

In [51]:
df.tail()

       A   B   C   D   E
1995  79   8   1  69  70
1996  70   3  29  12  37
1997  24  86  63  39  59
1998  69  27  61  46  20
1999  83  68  68  49  46

In [53]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [55]:
df['A']

0       13
1       91
2       55
3       43
4       66
        ..
1995    79
1996    70
1997    24
1998    69
1999    83
Name: A, Length: 2000, dtype: int64

In [56]:
df['F'] = df['E']+df['D']

In [57]:
df.head(10)

    A   B   C   D   E    F
0  13  85  41  32  63   95
1  91  59  94  44  46   90
2  55   6  63  25  36   61
3  43  62  79  95  14  109
4  66  47  34  48  82  130

In [61]:
del df['A']

In [62]:
df.head()

    B   C   D   E    F
0  85  41  32  63   95
1  59  94  44  46   90
2   6  63  25  36   61
3  62  79  95  14  109
4  47  34  48  82  130

In [ ]:
df.pop('B')

In [64]:
df.head()

    C   D   E    F
0  41  32  63   95
1  94  44  46   90
2  63  25  36   61
3  79  95  14  109
4  34  48  82  130

In [65]:
df.insert(2,'nueva',4)

In [66]:
df.head()

    C   D  nueva   E    F
0  41  32      4  63   95
1  94  44      4  46   90
2  63  25      4  36   61
3  79  95      4  14  109
4  34  48      4  82  130

Parecido al método `mutate` de `dplyr`, los DataFrames cuentan con el método `assign`. Esta operación no se hace en el lugar, sino que crea una copia del DataFrame para mantener el original intacto.

In [67]:
df.assign(nuevo_nombre=df['C']+df['nueva'])

       C   D  nueva   E    F  nuevo_nombre
0     41  32      4  63   95            45
1     94  44      4  46   90            98
2     63  25      4  36   61            67
3     79  95      4  14  109            83
4     34  48      4  82  130            38
...   ..  ..    ...  ..  ...           ...
1995   1  69      4  70  139             5
1996  29  12      4  37   49            33
1997  63  39      4  59   98            67
1998  61  46      4  20   66            65
1999  68  49      4  46   95            72

[2000 rows x 6 columns]

Seleccionar o indexar


|Operación|Sintaxis|Resultado|
|-----|----|---|
|Seleccionar columna|`df[col]`|Serie|
|Seleccionar fila por label| `df.loc[label]`|Serie|
|Seleccionar fila por ubicación|`df.iloc[loc]`|Serie|
|Slicing en las filas|`df[5:10]`|DataFrame|
|Seleccionar filas por vectores booleanos |`df[bool_vec]`|DataFrame|

In [68]:
df['C'].head()

0    41
1    94
2    63
3    79
4    34
Name: C, dtype: int64

In [69]:
df.loc[0:3:2]

    C   D  nueva   E   F
0  41  32      4  63  95
2  63  25      4  36  61

In [70]:
df.iloc[0:4,0:3]

    C   D  nueva
0  41  32      4
1  94  44      4
2  63  25      4
3  79  95      4

In [71]:
df[5:10]

    C   D  nueva   E    F
5  28  18      4  86  104
6  67  56      4  72  128
7   5   0      4  14   14
8  64  23      4  48   71
9   0  99      4  22  121

Con `pandas` se pueden leer distintos formatos:

- excel
- stata
- sas
- SQL
- CSV

In [72]:
data = pd.read_csv('/content/sample_data/california_housing_train.csv')

In [73]:
data.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [74]:
data.tail()

       longitude  latitude  ...  median_income  median_house_value
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[5 rows x 9 columns]

In [78]:
data.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [75]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           17000 non-null  float64
 1   latitude            17000 non-null  float64
 2   housing_median_age  17000 non-null  float64
 3   total_rooms         17000 non-null  float64
 4   total_bedrooms      17000 non-null  float64
 5   population          17000 non-null  float64
 6   households          17000 non-null  float64
 7   median_income       17000 non-null  float64
 8   median_house_value  17000 non-null  float64
dtypes: float64(9)
memory usage: 1.2 MB

In [82]:
df2 = data.astype('float32')

In [84]:
df2.astype({'total_rooms':'int32'}).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           17000 non-null  float32
 1   latitude            17000 non-null  float32
 2   housing_median_age  17000 non-null  float32
 3   total_rooms         17000 non-null  int32
 4   total_bedrooms      17000 non-null  float32
 5   population          17000 non-null  float32
 6   households          17000 non-null  float32
 7   median_income       17000 non-null  float32
 8   median_house_value  17000 non-null  float32
dtypes: float32(8), int32(1)
memory usage: 597.8 KB

In [85]:
data.shape

(17000, 9)

In [88]:
data.isna().sum()

longitude             0
latitude              0
housing_median_age    0
total_rooms           0
total_bedrooms        0
population            0
households            0
median_income         0
median_house_value    0
dtype: int64

In [89]:
data.isnull().sum()

longitude             0
latitude              0
housing_median_age    0
total_rooms           0
total_bedrooms        0
population            0
households            0
median_income         0
median_house_value    0
dtype: int64

In [90]:
data.mean()

longitude               -119.562108
latitude                  35.625225
housing_median_age        28.589353
total_rooms             2643.664412
total_bedrooms           539.410824
population              1429.573941
households               501.221941
median_income              3.883578
median_house_value    207300.912353
dtype: float64

In [91]:
data.std()

longitude                  2.005166
latitude                   2.137340
housing_median_age        12.586937
total_rooms             2179.947071
total_bedrooms           421.499452
population              1147.852959
households               384.520841
median_income              1.908157
median_house_value    115983.764387
dtype: float64

In [92]:
data.describe()

          longitude      latitude  ...  median_income  median_house_value
count  17000.000000  17000.000000  ...   17000.000000        17000.000000
mean    -119.562108     35.625225  ...       3.883578       207300.912353
std        2.005166      2.137340  ...       1.908157       115983.764387
min     -124.350000     32.540000  ...       0.499900        14999.000000
25%     -121.790000     33.930000  ...       2.566375       119400.000000
50%     -118.490000     34.250000  ...       3.544600       180400.000000
75%     -118.000000     37.720000  ...       4.767000       265000.000000
max     -114.310000     41.950000  ...      15.000100       500001.000000

[8 rows x 9 columns]

In [95]:
data.query('housing_median_age < 10')

       longitude  latitude  ...  median_income  median_house_value
58       -115.52     32.67  ...         2.0625             67700.0
75       -115.55     32.78  ...         2.8025             84300.0
95       -115.58     32.81  ...         4.4750             96300.0
98       -115.58     32.78  ...         5.7843            110100.0
100      -115.59     32.79  ...         6.3814            159900.0
...          ...       ...  ...            ...                 ...
16679    -122.79     38.48  ...         3.1662            191000.0
16680    -122.79     38.42  ...         5.0380            185600.0
16692    -122.82     38.55  ...         3.8616            195100.0
16776    -123.00     38.33  ...         5.6445            364800.0
16854    -123.49     38.70  ...         3.3125            295400.0

[1087 rows x 9 columns]

In [96]:
data[data['housing_median_age']<= 20]

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16987    -124.21     41.77  ...         2.5795             68400.0
16988    -124.21     41.75  ...         2.0074             66900.0
16991    -124.23     41.75  ...         2.4805             73200.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0

[5209 rows x 9 columns]

In [97]:
data[(data['housing_median_age']<= 20) & (data['total_rooms'] <=1500)] # &, |, ^

       longitude  latitude  ...  median_income  median_house_value
2        -114.56     33.69  ...         1.6509             85700.0
4        -114.57     33.57  ...         1.9250             65500.0
14       -114.63     32.76  ...         0.8585             45000.0
18       -114.66     32.74  ...         1.2049             44000.0
19       -114.67     33.92  ...         1.2656             27500.0
...          ...       ...  ...            ...                 ...
16885    -123.84     39.83  ...         1.5278            145800.0
16899    -124.05     40.94  ...         5.0329            165600.0
16912    -124.08     40.86  ...         1.1157            150000.0
16913    -124.08     40.06  ...         2.6250            135600.0
16959    -124.16     40.95  ...         3.1406             96000.0

[870 rows x 9 columns]

In [99]:
data.sample(n=100)

       longitude  latitude  ...  median_income  median_house_value
13012    -121.86     38.00  ...         5.2500            161700.0
14055    -122.05     37.54  ...         5.2882            223100.0
16679    -122.79     38.48  ...         3.1662            191000.0
2898     -117.75     33.95  ...         7.5839            426900.0
15946    -122.43     37.75  ...         3.5114            347500.0
...          ...       ...  ...            ...                 ...
8688     -118.56     34.19  ...         4.4330            235100.0
16351    -122.52     37.98  ...         2.8903            324200.0
11863    -121.34     36.76  ...         4.1528            336800.0
1319     -117.16     34.05  ...         6.0701            149900.0
989      -117.09     32.61  ...         2.1548            118800.0

[100 rows x 9 columns]

In [100]:
data.sort_values(by='housing_median_age')

       longitude  latitude  ...  median_income  median_house_value
13708    -122.00     38.23  ...         5.2636            191300.0
10993    -120.93     37.65  ...         4.2500            189200.0
1353     -117.17     34.12  ...         5.4138            164400.0
8765     -118.61     34.38  ...         6.6916            329500.0
8672     -118.56     34.42  ...         1.9667            450000.0
...          ...       ...  ...            ...                 ...
15193    -122.27     37.89  ...         7.2660            371100.0
15192    -122.27     37.89  ...         8.8342            430500.0
15190    -122.27     37.90  ...         6.1740            358800.0
15209    -122.27     37.85  ...         1.5817            153600.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [101]:
data.sort_values(by='housing_median_age', ascending=False)

       longitude  latitude  ...  median_income  median_house_value
16999    -124.35     40.54  ...         3.0147             94600.0
14561    -122.16     38.05  ...         3.1373            185100.0
6551     -118.28     34.18  ...         5.3185            358000.0
4420     -118.03     33.99  ...         3.4312            243800.0
14579    -122.16     37.74  ...         4.1458            143400.0
...          ...       ...  ...            ...                 ...
1880     -117.28     34.06  ...         5.1365            136700.0
4274     -118.01     34.55  ...         4.0710            137400.0
2771     -117.70     33.51  ...         6.8279            279000.0
10993    -120.93     37.65  ...         4.2500            189200.0
13708    -122.00     38.23  ...         5.2636            191300.0

[17000 rows x 9 columns]

In [102]:
data.sort_values(by=['housing_median_age','total_rooms'])

       longitude  latitude  ...  median_income  median_house_value
13708    -122.00     38.23  ...         5.2636            191300.0
10993    -120.93     37.65  ...         4.2500            189200.0
113      -115.80     33.26  ...         5.3374             47500.0
13345    -121.93     37.78  ...         3.1591            434700.0
1834     -117.27     33.93  ...         3.1042            164800.0
...          ...       ...  ...            ...                 ...
12193    -121.46     38.58  ...         3.8914            181600.0
16210    -122.48     37.79  ...         4.1148            457800.0
11163    -121.03     40.35  ...         2.1833             49500.0
15773    -122.41     37.79  ...         1.7240            225000.0
15772    -122.41     37.79  ...         2.5166            275000.0

[17000 rows x 9 columns]